bridge/README.md
```mermaid
classDiagram
    class Enchantment {
        <<interface>>
        +apply()*
        +onActivate()*
        +onDeactivate()*
    }
    class FlyingEnchantment {
        +apply()
        +onActivate()
        +onDeactivate()
    }
    class SoulEatingEnchantment {
        +apply()
        +onActivate()
        +onDeactivate()
    }
    class Weapon {
        <<interface>>
        +getEnchantment() Enchantment*
        +swing()*
        +unwield()*
        +wield()*
    }
    class Sword {
        -Enchantment enchantment
        +getEnchantment() Enchantment
        +swing()
        +unwield()
        +wield()
    }
    class Hammer {
        -Enchantment enchantment
        +getEnchantment() Enchantment
        +swing()
        +unwield()
        +wield()
    }
    Sword --> Enchantment : enchantment
    Hammer --> Enchantment : enchantment
    FlyingEnchantment ..|> Enchantment
    Hammer ..|> Weapon
    SoulEatingEnchantment ..|> Enchantment
    Sword ..|> Weapon
```
